* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
************************************************************************
**
***
***  AUTOR : PAJ
*
*
*                                                                  ***
***                                               FECHA              ***

** YO VOY INTRODUCIR  ERX
************************************************************************
************************************************************************
************************************************************************
************************************************************************
************************************************************************
DEFINE DATA 
LOCAL
*
1 VEHICLES VIEW OF VEHICLES
  2 MATRICULA (A15)
  2 BASTIDOR (B4)
  2 PROPIETARIO-ID (A8) /* NC
  2 N@AC-1 (I2) /* INDICATOR OF AC-1
  2 GRUPO-DETALLE
    3 MARCA (A20)
    3 MODELO (A20)
    3 COLOR (A10)
  2 ANIO (N4.0)
  2 CATEGORIA (A1)
  2 LEASE-PUR (A1)
  2 FECHA-COMPRA (N8.0)
  2 GRUPO-MANTENIMIENTO
    3 MONEDA (A3)
    3 COSTE-MANTENIMIEENTO (P7.0/1:191)   /* EJERCICIOS  
*
1 VEHICLES VIEW OF VEHICLES
  2 PROPIETARIO-ID  /* (A8)  
  2 MERXATRICULA       /* (A15) 
  2 BASTIDOR        /* (B4)  
  2 MARCA           /* (A20) 
  2 MODELO          /* (A20) 
  2 COLOR           /* (A10) 
  2 ANIO            /* (N4.0)
*  
1 VEHIUP VIEW OF VEHICLES
  2 PROPAJPIETARIO-ID  /* (A8)  
  2 MPAJATRICULA       /* (A15) 
  2 BASTPAJIDOR        /* (B4)  
  2 MARCA           /* (A20) 
  2 MPAJODELO          /* (A20) 
  2 CPAJOLOR           /* (A10) 
  2 APAJNIO            /* (N4.0)  
*
* MAPA ALTA VEHICULO
*
1 MCREATEV
  2 M-MATRICULA         (A15) 
  2 M-BASTIDOR          (B4)  
  2 M-MARCA             (A20) 
  2 M-MODELO            (A20) 
  2 M-COLOR             (A10) 
  2 M-ANIO              (N4.0)
*
**********
END-DEFINE /*  AQUI ACABAN LAS DECLARACIONES
********** 
*
SET KEY PF3 NAMED 'SALIR'
*
REPEAT
*
 INPUT USING MAP 'MCREATEV'
*
  DECIDE ON FIRST *PF-KEY
    VALUE 'ENTR'
      PERFORM CREAR-VEHICULO 
      RESET MCREATEV 
    VALUE 'PF3'
      ESCAPE ROUTINE
    NONE VALUE
      IGNORE
  END-DECIDE
END-REPEAT
*
********************************
DEFINE SUBROUTINE CREAR-VEHICULO
********************************
*
* SW-DATOSCORRECTOS :=TRUE
* *
* * la matricula no se puede duplicar.
* *
* LEER VEHICULOS PARA BUSCAR MATRICULA
*       SI MATRICULA ENCONTRADA
*          datsocorrectso igual a falso
*          WRITE ' MATRICULA DUPLICADA' 
*          ESCPAPE ROUTINE 
*       
*       FINAL SI
* *      
* FINAL LEER
* *
* WRITE ' DEPUES DEL READ'
*
VEHICLES.PROPIETARIO-ID  :=   '50000100'
VEHICLES.MATRICULA       :=   MCREATEV.M-MATRICULA      
VEHICLES.BASTIDOR        :=   MCREATEV.M-BASTIDOR       
VEHICLES.MARCA           :=   MCREATEV.M-MARCA          
VEHICLES.MODELO          :=   MCREATEV.M-MODELO         
VEHICLES.COLOR           :=   MCREATEV.M-COLOR          
VEHICLES.ANIO            :=   MCREATEV.M-ANIO           
*
STORE VEHICLES
END TRANSACTION
*
********************************************
END-SUBROUTINE /* SUBROUTINE CREAR-VEHICULO
*******************************************
*
END