* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
************************************************************************
*   APLICACCION   PARA CREAR VEHICULO                                       *        
*                                                                      *
*   CREADO POR USARIO AAAAA                                            *
*                     31/10/2023                                       *
*                                                                      *
*                                                                      *
************************************************************************
*
************************************************************************
*
************************************************************************
*   EZEQUIEL       PET. 798
************************************************************************
*
DEFINE DATA 
LOCAL
*
/* 798 Eliminamos la declaración de la vista. 
*
* MAPA ALTA VEHICULO
*
1 MCREATEV
  2 M-MATRICULA         (A15) 
  2 M-BASTIDOR          (B4)  
  2 M-MARCA             (A20) 
  2 M-MODELO            (A20) 
  2 M-COLOR             (A10) 
  2 M-ANIO              (N4.0)
*
1 PAR-CREARVEH
  2 PAR-PROPIETARIO-ID1   (A8)
  2 PAR-MATRICULA1       (A15)
  2 PAR-BASTIDOR1        (B4)
  2 PAR-MARCA1           (A20)
  2 PAR-MODELO1          (A20)
  2 PAR-COLOR1           (A10)
  2 PAR-ANIO1            (N4.0)
  2 PAR-ERR1             (N4)
  2 PAR-DESC1            (A70)
*
**********
END-DEFINE /*  AQUI ACABAN LAS DECLARACIONES
********** 
*
SET KEY PF3 NAMED 'SALIR'
*
REPEAT
*
  INPUT USING MAP 'MCREATEV'
*
  DECIDE ON FIRST *PF-KEY
    VALUE 'ENTR'
      PERFORM CREAR-VEHICULO
      RESET MCREATEV 
    VALUE 'PF3'
      ESCAPE ROUTINE
    NONE VALUE
      IGNORE
  END-DECIDE
END-REPEAT
*
********************************
DEFINE SUBROUTINE CREAR-VEHICULO      /* 798-INI
********************************
*                                          
* SE EXTERNALIZA LA CREACIÓN DEL VEHICULOS COMO INDICA EL EVOLUTIVO
*
* 1 PAR-CREARVEH
*   2 PAR-PROPIETARIO-ID1   (A8)
*   2 PAR-MATRICULA1       (A15)
*   2 PAR-BASTIDOR1        (B4)
*   2 PAR-MARCA1           (A20)
*   2 PAR-MODELO1          (A20)
*   2 PAR-COLOR1           (A10)
*   2 PAR-ANIO1            (N4.0)
*   2 PAR-ERR1             (N4)
*   2 PAR-DESC1            (A70)
*
PAR-CREARVEH.PAR-PROPIETARIO-ID1 :=   '50000100'
PAR-CREARVEH.PAR-MATRICULA1      :=   MCREATEV.M-MATRICULA
PAR-CREARVEH.PAR-BASTIDOR1       :=   MCREATEV.M-BASTIDOR
PAR-CREARVEH.PAR-MARCA1          :=   MCREATEV.M-MARCA
PAR-CREARVEH.PAR-MODELO1         :=   MCREATEV.M-MODELO
PAR-CREARVEH.PAR-COLOR1          :=   MCREATEV.M-COLOR
PAR-CREARVEH.PAR-ANIO1           :=   MCREATEV.M-ANIO
*
* CALLNAT 'CREARVE2'  PAR-CREARVEH                                          
*
IF  PAR-CREARVEH.PAR-ERR1 NE 0  /* IGUAL A 0 NO HAY ERRORES. 
    WRITE ' ENTRO EN EL IF'
    WRITE ' HAY UN ERROR' 
END-IF
*                                       
********************************************
END-SUBROUTINE /* SUBROUTINE CREAR-VEHICULO     /* 798-FIN
*******************************************
*
END
