* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA 
LOCAL
*
1 VEHICLES VIEW OF VEHICLES
  2 PROPIETARIO-ID  /* (A8)  
  2 MATRICULA       /* (A15) 
  2 BASTIDOR        /* (B4)  
  2 MARCA           /* (A20) 
  2 MODELO          /* (A20) 
  2 COLOR           /* (A10) 
  2 ANIO            /* (N4.0)
*  
1 VEHIUP VIEW OF VEHICLES
  2 PROPIETARIO-ID  /* (A8)  
  2 MATRICULA       /* (A15) 
  2 BASTIDOR        /* (B4)  
  2 MARCA           /* (A20) 
  2 MODELO          /* (A20) 
  2 COLOR           /* (A10) 
  2 ANIO            /* (N4.0)  
*
* MAPA ALTA VEHICULO
*
1 MCREATEV
  2 M-MATRICULA         (A15) 
  2 M-BASTIDOR          (B4)  
  2 M-MARCA             (A20) 
  2 M-MODELO            (A20) 
  2 M-COLOR             (A10) 
  2 M-ANIO              (N4.0)
*
**********
END-DEFINE /*  AQUI ACABAN LAS DECLARACIONES
********** 
*
SET KEY PF3 NAMED 'SALIR'
*
REPEAT
*
 INPUT USING MAP 'MCREATEV'
*
  DECIDE ON FIRST *PF-KEY
    VALUE 'ENTR'
      PERFORM CREAR-VEHICULO 
      RESET MCREATEV 
    VALUE 'PF3'
      ESCAPE ROUTINE
    NONE VALUE
      IGNORE
  END-DECIDE
END-REPEAT
*
********************************
DEFINE SUBROUTINE CREAR-VEHICULO
********************************
*
* SW-DATOSCORRECTOS :=TRUE
* *
* * la matricula no se puede duplicar.
* *
* LEER VEHICULOS PARA BUSCAR MATRICULA
*       SI MATRICULA ENCONTRADA
*          datsocorrectso igual a falso
*          WRITE ' MATRICULA DUPLICADA' 
*          ESCPAPE ROUTINE 
*       
*       FINAL SI
* *      
* FINAL LEER
* *
* WRITE ' DEPUES DEL READ'
*
VEHICLES.PROPIETARIO-ID  :=   '50000100'
VEHICLES.MATRICULA       :=   MCREATEV.M-MATRICULA      
VEHICLES.BASTIDOR        :=   MCREATEV.M-BASTIDOR       
VEHICLES.MARCA           :=   MCREATEV.M-MARCA          
VEHICLES.MODELO          :=   MCREATEV.M-MODELO         
VEHICLES.COLOR           :=   MCREATEV.M-COLOR          
VEHICLES.ANIO            :=   MCREATEV.M-ANIO           
*
STORE VEHICLES
END TRANSACTION
*
********************************************
END-SUBROUTINE /* SUBROUTINE CREAR-VEHICULO
*******************************************
*
END