* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
************************************************************************
*   APLICACCION   PARA CREAR VEHICULO                                       *        
*                                                                      *
*   CREADO POR USARIO AAAAA                                            *
*                     31/10/2023                                       *
*                                                                      *
*                                                                      *
************************************************************************
*
************************************************************************
*
************************************************************************
*   EZEQUIEL       PET. 798
************************************************************************
*
DEFINE DATA 
LOCAL USING CREARVEP   /* AREA DATOS CREAR VEHICULO 798
LOCAL
*
/* 798 Eliminamos la declaración de la vista. 
*
* MAPA ALTA VEHICULO
*
1 MCREATEV
  2 M-MATRICULA         (A15) 
  2 M-BASTIDOR          (B4)  
  2 M-MARCA             (A20) 
  2 M-MODELO            (A20) 
  2 M-COLOR             (A10) 
  2 M-ANIO              (N4.0)
*
**********
END-DEFINE /*  AQUI ACABAN LAS DECLARACIONES
********** 
*
SET KEY PF3 NAMED 'SALIR'
*
REPEAT
*
  INPUT USING MAP 'MCREATEV'
*
  DECIDE ON FIRST *PF-KEY
    VALUE 'ENTR'
      PERFORM CREAR-VEHICULO
      RESET MCREATEV 
    VALUE 'PF3'
      ESCAPE ROUTINE
    NONE VALUE
      IGNORE
  END-DECIDE
END-REPEAT
*
********************************
DEFINE SUBROUTINE CREAR-VEHICULO      /* 798-INI
********************************
*                                          
* SE EXTERNALIZA LA CREACIÓN DEL VEHICULOS COMO INDICA EL EVOLUTIVO
*
CREARVEP.PAR-PROPIETARIO-ID  :=   '50000100'
CREARVEP.PAR-MATRICULA       :=   MCREATEV.M-MATRICULA
CREARVEP.PAR-BASTIDOR        :=   MCREATEV.M-BASTIDOR
CREARVEP.PAR-MARCA           :=   MCREATEV.M-MARCA
CREARVEP.PAR-MODELO          :=   MCREATEV.M-MODELO
CREARVEP.PAR-COLOR           :=   MCREATEV.M-COLOR
CREARVEP.PAR-ANIO            :=   MCREATEV.M-ANIO
*
* LLAMAMOS AL SUBRPOGRAMA CON EL AREA INFORMADA
*
CALLNAT 'CREARVEH'  CREARVEP                                             
*
IF  CREARVEP.PAR-ERR NE 0  /* IGUAL A 0 NO HAY ERRORES. 
    WRITE ' HAY UN ERROR' 
END-IF
*                                       
********************************************
END-SUBROUTINE /* SUBROUTINE CREAR-VEHICULO     /* 798-FIN
*******************************************
*
END
